# Запросим у пользователя ввод для каждого этапа развития человека

stage1 = input("Введите первую стадию развития человека: ")
stage2 = input("Введите вторую стадию развития человека: ")
stage3 = input("Введите третью стадию развития человека: ")
stage4 = input("Введите четвертую стадию развития человека: ")
stage5 = input("Введите пятую стадию развития человека: ")
stage6 = input("Введите шестую стадию развития человека: ")

# Выводим все стадии, разделенные знаком =>

print(stage1, stage2, stage3, stage4, stage5, stage6, sep=" => ")