# Запрашиваем у пользователя ввод целого числа
number = int(input("Введите целое число: "))

# Определяем строку-описание числа
if number == 0:
    print("нулевое число")
elif number > 0:
    if number % 2 == 0:
        print("положительное четное число")
    else:
        print("положительное нечетное число")
        print("число не является четным")
else:
    if number % 2 == 0:
        print("отрицательное четное число")
    else:
        print("отрицательное нечетное число")
        print("число не является четным")
